# AnalysisDisplayDeformedShapeSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDeformedShapeSettings Class
Members See Also
---
Contains deformed shape settings for analysis display style element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class AnalysisDisplayDeformedShapeSettings : IDisposable
```

Visual Basic
---
```text
Public Class AnalysisDisplayDeformedShapeSettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class AnalysisDisplayDeformedShapeSettings : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..AnalysisDisplayDeformedShapeSettings
# See Also
AnalysisDisplayDeformedShapeSettings Members
Autodesk.Revit.DB.Analysis Namespace